# Задача 12:
# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных
# числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя
# делает две подсказки. Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

# Ввод данных через map
s, p = list(map(int, input('Введите сумму и произведение: ').split(' ')))

# Нахождение переменных через дискриминант
x = (s - ((s**2  - p*4)**0.5)) // 2
y = (s + ((s**2 - 4*p))**0.5) // 2

print(int(x), int(y))