# Задача 24:
# В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке,
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно
# два соседних. Всего на грядке растёт N кустов. Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло
# ai ягод. В этом фермерском хозяйстве внедрена система автоматического сбора черники.

# Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий
# модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды
# с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод, которое может собрать за один
# заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

import random

n = int(input('Введите кол-во кустов: '))

lst = [random.randint(1, 10) for i in range(n)]
# lst = [int(input(f'Введите кол-во ягод на {i + 1}-м кусте: ')) for i in range (n)]
print(*lst)

sum_lst = []

for i in range(len(lst)):
       sum_lst.append(lst[i-2] + lst[i-1] + lst[i])

print(max(sum_lst))